0xA2C3B1F4/Salpa/security/esp-idf-bootloader/sdkconfig.defaults.esp32s2
# Host-build compatibility spike only. Do not flash this configuration.
CONFIG_IDF_TARGET="esp32s2"

CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_OFFSET=0xE000

CONFIG_SECURE_BOOT=y
CONFIG_SECURE_BOOT_V2_ENABLED=y
CONFIG_SECURE_SIGNED_APPS_RSA_SCHEME=y
# CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES is not set
# CONFIG_SECURE_BOOT_FLASH_BOOTLOADER_DEFAULT is not set
# CONFIG_SECURE_BOOT_INSECURE is not set

# Flash encryption remains a separate physical gate. This build-only
# configuration must not enable it implicitly.
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
